Revit 2027 API
ParameterTypeId.PropertyLengthUnits Property
 "Units Format"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PropertyLengthUnits { get; }
Public Shared ReadOnly Property PropertyLengthUnits As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PropertyLengthUnits {
	ForgeTypeId^ get ();
}
static member PropertyLengthUnits : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace